; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	spectrograph0 - mode
	infrared1 - mode
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation2 - direction
	Star5 - direction
	Star4 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star6)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument8 infrared1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star5)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Star10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Star14 spectrograph0)
	(have_image Star15 infrared1)
))

)

; plan
1. (turn_to satellite0 star3 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star3)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet9)
   goals met: 0 of 9
5. (take_image satellite0 planet9 instrument0 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 1 of 9
6. (turn_to satellite0 planet13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet13)
   goals met: 1 of 9
7. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 2 of 9
8. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 2 of 9
9. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon12 instrument0 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 5 of 9
14. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 5 of 9
15. (take_image satellite0 star10 instrument0 infrared1)
   added: (have_image star10 infrared1)
   goals met: 6 of 9
16. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 6 of 9
17. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 7 of 9
18. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
19. (take_image satellite0 star15 instrument0 infrared1)
   added: (have_image star15 infrared1)
   goals met: 8 of 9
20. (turn_to satellite0 star8 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
21. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 9 of 9
